cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/services'

# Tools
brew 'bash'
brew 'exercism'
brew 'git'
brew 'gpg'
brew 'gpg-agent'
brew 'jq'
brew 'pinentry-mac'
brew 'siege'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'

# Languages/Runtimes
brew 'go'
brew 'elixir'

# Databases
brew 'mongodb'
brew 'postgresql'
brew 'redis'

# Mac App Store
mas 'BetterSnapTool', id: 417375580

# Apps
cask '1password'
cask 'apptivate'
cask 'brave'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'kitematic'
cask 'mongohub'
cask 'postgres'
cask 'postman'
cask 'screenhero'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'visual-studio-code'

# Games
cask 'battle-net'
cask 'league-of-legends'
cask 'minecraft'
cask 'starcraft'
cask 'steam'
cask 'twitch'
