cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/services'

# Tools
brew 'bash'
brew 'ffmpeg'
brew 'git'
brew 'gpg'
brew 'imagemagick', args: ["with-librsvg"]
brew 'jq'
brew 'pinentry-mac'
brew 'python3'
brew 'siege'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn', args: ["without-node"]
brew 'zsh'
brew 'zsh-completions'

# Mac App Store
# mas 'BetterSnapTool', id: 417375580
# mas 'Apple Configurator 2', id: 1037126344

# Apps
cask '1password'
cask 'apptivate'
cask 'brave'
cask 'discord'
cask 'docker'
cask 'balenaetcher'
cask 'firefox'
cask 'chrome'
cask 'chromium'
cask 'insomnia'
cask 'jeromelebel-mongohub'
cask 'keybase'
cask 'kitematic'
cask 'postman'
cask 'psequel'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'visual-studio-code'
cask 'vivaldi'

# Games
cask 'battle-net'
cask 'league-of-legends'
cask 'minecraft'
cask 'steam'
cask 'twitch'
