cask_args appdir: '/Applications'
tap 'homebrew/services'

# Tools
brew 'bash'
brew 'buku'
brew 'elixir'
brew 'ffmpeg'
brew 'git'
brew 'gpg'
brew 'grep'
brew 'imagemagick'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubeseal'
brew 'kustomize'
brew 'pinentry-mac'
brew 'python3'
brew 'shellcheck'
brew 'siege'
brew 'skaffold'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'ykman'
brew 'zsh'
brew 'zsh-completions'

# Mac App Store
# mas 'Apple Configurator 2', id: 1037126344

# Apps
cask '1password'
cask 'apptivate'
cask 'balenaetcher'
cask 'bartender'
cask 'bettertouchtool'
cask 'boostnote'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'jeromelebel-mongohub'
cask 'keybase'
cask 'kitematic'
cask 'minikube'
cask 'notion'
cask 'postman'
cask 'psequel'
cask 'slack'
cask 'visual-studio-code'
cask 'zoomus'

# Games
cask 'battle-net'
cask 'league-of-legends'
cask 'minecraft'
cask 'steam'
cask 'twitch'
