brew "autojump"
brew "bash"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "git"
brew "gnupg"
brew "grep"
brew "imagemagick"
brew "jq"
brew "neofetch"
brew "pinentry-mac" if OS.mac?
brew "python"
brew "shellcheck"
brew "siege"
brew "tmux"
brew "trash"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "ykman"
brew "zsh-completions"
brew "zsh"

# fonts
tap "homebrew/cask-fonts"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"

# Browsers
cask "arc" if OS.mac?
cask "firefox"
# cask "google-chrome"
# cask "chromium", args: { no_quarantine: true }
# cask "microsoft-edge"

# apps
cask "1password"
# cask "balenaetcher" if OS.mac?
cask "bettertouchtool" if OS.mac?
cask "discord"
# cask "keybase"
cask "slack"
# cask "zoom"
cask "kap"
# cask "figma" # Currently prefering just using the web app
# mas "Apple Configurator", id: 1037126344 if OS.mac?

# development tools
brew "mongosh"
tap "mongodb/brew"
brew "mongodb-database-tools"
cask "mongodb-compass"
brew "lazydocker"
cask "docker" if OS.mac?
brew "mise"
# brew "yarn"
brew "flyctl"
cask "tableplus"
# cask "utm" if OS.mac?
cask "visual-studio-code"
brew "gh"

# elixir/erlang
brew "autoconf"
brew "openssl"
brew "wxwidgets"
brew "libxslt"
brew "fop"

# Games
cask "battle-net" if OS.mac?
cask "minecraft" if OS.mac?
cask "steam"
# cask "epic-games" # I don't play many of these games
# cask "gog-galaxy" # I don't play many of these games
# cask "league-of-legends" # I rarely play this
